// Algerian Wilayas and Baladiyas Data (Comprehensive)
const locationData = {
    "01": ["أدرار", "تامنطيط", "شاروين", "رقان", "إن زغمير", "تيت", "قصر قدور", "تسابيت", "تيميمون", "أولاد سعيد", "زاوية كنتة", "أولف", "تيمقطن", "فنوغيل", "تينركوك", "دلدول", "سالي", "أقبلي", "المطارفة", "أولاد أحمد تيمي", "بودا", "أوقروت", "طلمين", "برج باجي مختار", "السبع", "أولاد عيسى"],
    "02": ["الشلف", "تنس", "بنايرية", "الكريمية", "تاجنة", "تاوقريت", "بني حواء", "الصبحة", "حرشون", "أولاد فارس", "سيدي عكاشة", "بوقادير", "بني راشد", "تلاصة", "الهرنفة", "وادي قوسين", "الظهرة", "أولاد عباس", "سنجاس", "الزبوجة", "وادي سلي", "أبو الحسن", "المرسى", "الشطية", "سيدي عبد الرحمن", "مصدق", "الحجاج", "الأبيض مجاجة", "وادي الفضة", "أولاد بن عبد القادر", "بوزغاية", "سيدي بوزيد", "بني بوعتاب", "بريرة", "بني مريت"],
    "03": ["الأغواط", "قصر الحيران", "بن ناصر بن شهرة", "سيدي مخلوف", "حاسي الدلاعة", "حاسي الرمل", "عين ماضي", "تادجموت", "الخنق", "قلتة سيدي سعد", "عين سيدي علي", "البيضاء", "بريدة", "الغيشة", "الحاج مشري", "سبقاق", "تاويالة", "سيدي بوزيد", "وادي مرة", "وادي مزي", "الحويطة", "الخنق", "أفلو"],
    "04": ["أم البواقي", "عين البيضاء", "عين مليلة", "عين فكرون", "عين كرشة", "التلاغمة", "هنشير تومغني", "وادي نيني", "عين ببوش", "عين الزيتون", "أولاد حملة", "العامرية", "فكيرينة", "وادي زناتي", "بئر الشهداء", "سوق نعمان", "أولاد قاسم", "أولاد زواي", "الرحية", "مسكيانة", "الضلعة", "الجازية", "البلالة", "بحير الشرقي"],
    "05": ["باتنة", "بريكة", "عين التوتة", "مروانة", "نقاوس", "المعذر", "تازولت", "آريس", "راس العيون", "سريانة", "الجزار", "عين ياقوت", "عين جاسر", "بومقر", "فسديس", "الشمرة", "وادي الماء", "القصبات", "منعة", "تيمقاد", "ثنية العابد", "تكوت", "إشمول", "بوزينة", "أولاد سي سليمان", "بريش", "أولاد عمار", "أولاد سلام", "أولاد فاضل", "أولاد عوف", "أولاد شليح", "أولاد سيدي إبراهيم", "أولاد التومي", "أولاد بالعم", "أولاد الحوار", "أولاد العياضي", "أولاد موسى", "أولاد رابح", "أولاد عثمان"],
    "06": ["بجاية", "أقبو", "خراطة", "صدوق", "سيدي عيش", "أوقاس", "أميزور", "تيمزريت", "تازمالت", "القصر", "تيشي", "شميني", "أدكار", "أيت رزين", "ذراع القايد", "سوق الاثنين", "توجة", "بني مليكش", "بني معوش", "بني كسيلة", "تيزي نبربر", "بوخليفة", "أيت إسماعيل", "أيت تيزي", "كنديرة", "فرعون", "مسيسنة", "أيت معوش", "أمالو", "بوحمزة", "تامقرة", "إغيل علي", "أيت يحيى موسى", "أيت بوأد", "أيت لعزيز", "أيت ميمون", "أيت بوعيسي"],
    "07": ["بسكرة", "طولقة", "سيدي عقبة", "مشونش", "ليوة", "القنطرة", "جمورة", "أورلال", "الحوش", "عين الناقة", "سيدي خليل", "البرانيس", "الدوسن", "فوغالة", "لغروس", "بوشقرون", "مخادمة", "أولاد جلال", "سيدي خالد", "البسباس", "راس الميعاد", "عين الريش", "بئر الفضة", "سيدي عمر", "سيدي سليمان", "سيدي بوزيد", "سيدي عمار", "سيدي عبد الرحمان", "سيدي مصطفي", "سيدي محمد بن علي", "سيدي يحيى", "سيدي يوسف", "سيدي يعقوب", "سيدي زروق", "سيدي سالم", "سيدي عامر", "سيدي لخضر", "سيدي مهدي", "سيدي موسى", "سيدي الهواري", "سيدي علي"],
    "08": ["بشار", "القنادسة", "العبادلة", "بني ونيف", "تاغيت", "بني عباس", "الواتة", "كرزاز", "أولاد خضير", "تيمودي", "موغل", "بوكايس", "لحمر", "المريجة", "عين الصفراء", "المشرية", "النعامة", "مغرار", "تيوت", "عسلة", "جنين بورزق", "صفيصيفة", "البيوض", "عين بن خليل", "مكمن بن عمار", "القسدير", "طبيلة"],
    "09": ["البليدة", "بوفاريك", "الأربعاء", "العفرون", "موزاية", "الشبلي", "بوعرفة", "وادي العلايق", "مفتاح", "الصومعة", "أولاد يعيش", "بني تامو", "بني مراد", "بن خليل", "أولاد سلامة", "الجبابرة", "وادي جر", "حمام ملوان", "بوقرة", "الشريعة", "عين الرمانة", "قرواو", "الشفة", "بني خليل"],
    "10": ["البويرة", "عين الترك", "آيت لعزيز", "أهل القصر", "أيت منصور", "أعمـر", "عين بسام", "عين الحجر", "عين العلوي", "بشلول", "العجيبة", "بئر غبالو", "برج أوخريص", "بودربالة", "بوكرم", "الشرفة", "الدشمية", "ديرة", "جباحية", "الأسنام", "الهاشمية", "الحاكمية", "الخبوزية", "المقراني", "القرومة", "حيزر", "الحجرة الزرقاء", "القادرية", "الأخضرية", "مشدالة", "المعمورة", "معالة", "مزدور", "وادي البردي", "أولاد راشد", "روراوة", "ريدان", "صحاريج", "سوق الخميس", "سور الغزلان", "تاغزوت", "تغديت", "الزبربر"],
    "11": ["تمنراست", "أبالسة", "عين أمقل", "عين قزام", "إدلس", "تاظروك", "تين زواتين", "عين صالح", "فقارة الزوى", "إن غار"],
    "12": ["تبسة", "بير العاتر", "الشريعة", "الونزة", "الحمامات", "الماء الأبيض", "العقلة", "بكارية", "بوخضرة", "بولحاف الدير", "بئر مقدم", "بئر الذهب", "الحويجبات", "سطح قنتيس", "العويمرات", "فركان", "قريقر", "مرسط", "المزرعة", "نقرين", "أم علي", "عين الزرقاء", "صفصاف الوسرة"],
    "13": ["تلمسان", "مغنية", "منصورة", "الرمشي", "الحناية", "شتوان", "أولاد ميمون", "عين تالوت", "باب العسة", "بني بوسعيد", "بني سنوس", "بني مستار", "بني ورسوس", "عين غرابة", "بوحلو", "عين فزة", "الفحلة", "الغزوات", "جبالة", "ندرومة", "سبدو", "سيدي الجيلالي", "سيدي مجاهد", "تيانت", "الواد الأخضر"],
    "14": ["تيارت", "السوقر", "فرندة", "قصر الشلالة", "مهدية", "رحوية", "عين الذهب", "عين كرمس", "الدحموني", "النعيمة", "مدروسة", "وادي ليلي", "سيدي حسني", "سيدي عبد الرحمن", "ملاكو", "توسنينة", "عين بوشقيف", "سيدي بختي", "الرصفة", "مشرع الصفا", "زمالة الأمير عبد القادر"],
    "15": ["تيزي وزو", "عزازقة", "ذراع بن خدة", "تيزي غنيف", "ذراع الميزان", "بوغني", "عين الحمام", "الأربعاء ناث إيراثن", "مقلع", "واسيف", "بني دوالة", "بني يني", "بوزغن", "ماكودة", "تيزي راشد", "تادمليت", "أيت يحيى موسى", "فريحة", "إيفيغاء", "إعكوران", "أزفون", "تيقزيرت"],
    "16": ["الجزائر الوسطى", "سيدي امحمد", "المدنية", "بلوزداد", "باب الوادي", "بولوغين", "القصبة", "وادي قريش", "بئر مراد رايس", "الأبيار", "بوزريعة", "بئر خادم", "الحراش", "براقي", "وادي السمار", "باش جراح", "حسين داي", "القبة", "الدار البيضاء", "باب الزوار", "بن عكنون", "دالي إبراهيم", "الحمامات", "رايس حميدو", "جسر قسنطينة", "المرادية", "حيدرة", "المحمدية", "برج الكيفان", "المغارية", "بني مسوس", "الكاليتوس", "بئر توتة", "تسالة المرجة", "أولاد شبل", "سيدي موسى", "عين طاية", "برج البحري", "المرسى", "هراوة", "رويبة", "رغاية", "عين بنيان", "سطاوالي", "زرالدة", "المحالمة", "الرحمانية", "السويدانية", "الشراقة", "أولاد فايت", "العاشور", "درارية", "الدويرة", "بابا حسن", "خرايسية", "السحاولة"],
    "17": ["الجلفة", "عين وسارة", "مسعد", "حاسي بحبح", "الإدريسية", "دار الشيوخ", "الشارف", "البيرين", "القديد", "عين الإبل", "المجبارة", "سيدي لعجال", "عمورة", "عين فقة", "تعظميت", "عين معبد", "حاسي العش", "فيض البطمة", "الزعفران", "سد الرحال", "زكار", "الخميس"],
    "18": ["جيجل", "الميلية", "الطاهير", "جيملة", "texenna", "العوانة", "زيامة منصورية", "الشقفة", "القنار نشفي", "سيدي عبد العزيز", "قاوة", "الأمير عبد القادر", "وجانة", "الجمعة بني حبيبي", "برج الطهر", "أولاد يحيى خدروش", "أولاد عسكر", "بوسيف أولاد عسكر", "سلمى بن زيادة", "إيراقن سويسي"],
    "19": ["سطيف", "العلمة", "عين ولمان", "عين كبيرة", "عين أرنات", "عموشة", "بوقاعة", "جميلة", "بني عزيز", "بني ورتيلان", "حمام السخنة", "مزلوق", "بئر العرش", "بيضاء برج", "ماوكلان", "قجال", "أوريسيا", "تيزي نبشار", "صالح باي", "عين عباسة", "عين الروى", "حربيل", "الرصفة"],
    "20": ["سعيدة", "عين الحجر", "يوب", "الحساسنة", "سيدي بوبكر", "أولاد خارف", "مولاي العربي", "عين السخونة", "سيدي عمار", "أولاد إبراهيم", "تيرسين", "دوي ثابت", "عين سلطان", "المعمورة", "الحنصالة", "سيدي أحمد"],
    "21": ["سكيكدة", "القل", "الحروش", "عزابة", "رمضان جمال", "تمالوس", "عين قشرة", "أم الطوب", "بني زيد", "الزيتونة", "زردازة", "أولاد عطية", "بين الويدان", "سيدي مزغيش", "الحدائق", "بكوش لخضر", "حمادي كرومة", "مجاز الدشيش", "بني بشير", "الغدير"],
    "22": ["سيدي بلعباس", "سفيزف", "بن باديس", "تلاغ", "رأس الماء", "تنيرة", "سيدي علي بن يوب", "سيدي لحسن", "عين البرد", "مصطفى بن إبراهيم", "مرحوم", "مرين", "تلموني", "سيدي حمادوش", "سيدي خالد", "بلعربي", "بني مسهل", "سيدي يعقوب"],
    "23": ["عنابة", "البوني", "الحجار", "سيدي عمار", "برحال", "عين الباردة", "شطايبي", "سرايدي", "التريعات", "واد العنب", "الشرفة", "العلمة"],
    "24": ["قالمة", "وادي الزناتي", "بوشقوف", "هليوبوليس", "عين مخلوف", "تاملوكة", "حمام دباغ", "الركنية", "بومهرة أحمد", "الفجوج", "بن جراح", "بلخير", "حمام النبايل", "الدهوارة", "هواري بومدين", "مجاز عمار", "سلاوة عنونة", "نشماية", "قلعة بوصبع", "جبالة الخميسي"],
    "25": ["قسنطينة", "الخروب", "حامة بوزيان", "زيغود يوسف", "ديدوش مراد", "عين عبيد", "أولاد رحمون", "عين سمارة", "بن باديس", "ابن زياد", "مسعود بوجريو", "بني حميدان"],
    "26": ["المدية", "البرواقية", "قصر البخاري", "عمارية", "تابلات", "الشهبونية", "العمارية", "سيدي نعمان", "وزرة", "العزيزية", "بني سليمان", "سغوان", "الزبيرية", "مجبر", "عين بوسيف", "جواب", "سيدي زهار", "ميهوب", "بوسكن", "شلالة العذاورة"],
    "27": ["مستغانم", "عين تادلس", "بوقيرات", "سيدي علي", "سيدي لخضر", "عشاشة", "ماسرة", "عين النويصي", "مزغران", "حسيان", "بن عبد المالك رمضان", "خير الدين", "صيادة", "سوافلية", "صفصاف", "نقمارية", "أولاد بوغالم"],
    "28": ["المسيلة", "بوسعادة", "سيدي عيسى", "مقرة", "أولاد دراج", "حمام الضلعة", "برهوم", "عين الحجل", "الشلال", "بن سرور", "أولاد سيدي إبراهيم", "سيدي عامر", "تامسة", "عين الملح", "محمد بوضياف", "جبل مسعد", "سيدي هجرس", "عين الخضراء", "بلعايبة"],
    "29": ["معسكر", "سيق", "تيغنيف", "المحمدية", "غريس", "بوحنيفية", "واد التاغية", "عقاز", "العلايمية", "مطمور", "سيدي عبد المومن", "عين فكان", "وادي الأبطال", "سيدي قادة", "زحانة", "بنيان", "الماين", "خلوية", "البرج", "عين فارس"],
    "30": ["ورقلة", "تقرت", "حاسي مسعود", "عين البيضاء", "الرويسات", "النزلة", "تماسين", "المقارين", "بني ثور", "سيدي خويلد", "الطيبات", "الزاوية العابدية", "انقوسة", "الحجيرة", "المغير", "جامعة", "المنيعة", "حاسي الفحل"],
    "31": ["وهران", "بئر الجير", "السانية", "أرزيو", "سيدي الشحمي", "عين الترك", "قديل", "بطيوة", "مسرحين", "حاسي بونيف", "الكرمة", "وادي تليلات", "بوسفر", "العنصر", "مرسى الحجاج", "بوتليليس", "حاسي مفسوخ", "سيدي بن يبقى", "بن فريحة", "طفراوي", "عين البية", "عين الكرمة", "البرية", "المحقن"],
    "32": ["البيض", "الأبيض سيدي الشيخ", "بريزينة", "بوقطب", "الخيثر", "الرقاصة", "الشلالة", "بوسمغون", "الكاف الأحمر", "المحرة", "عين العراك", "اربوات", "سيدي أعمر", "سيدي طيفور", "الغاسول", "استيتن", "شقيق", "سيدي سليمان"],
    "33": ["إيليزي", "جانت", "إن أميناس", "برج الحواس", "برج عمر إدريس", "الدبداب"],
    "34": ["برج بوعريريج", "رأس الوادي", "برج غدير", "المنصورة", "مجانة", "بئر قاصد علي", "الحمادية", "عين تاغروت", "خليل", "سيدي مبارك", "الياشير", "العناصر", "حرازة", "بن داود", "المهير", "أولاد سيدي إبراهيم", "تسامرت", "برج زمورة"],
    "35": ["بومرداس", "برج منايل", "بودواو", "دلس", "الثنية", "يسر", "زموري", "قورصو", "سي مصطفى", "حمادي", "شعبات العامر", "بغلية", "أولاد موسى", "خروبة", "الأربعطاش", "تيجلابين", "الناصرية", "بني عمران", "سوق الحد", "لقاطة", "أعفير"],
    "36": ["الطارف", "بوثلجة", "بن مهيدي", "القالة", "الذرعان", "البسباس", "عين العسل", "العيون", "بحيرة الطيور", "الزيتونة", "شبيطة مختار", "شيحاني", "عصفور", "الذريعات", "رمل السوق", "بوقوس", "وادي الزيتون", "السوارخ", "عين الكرمة", "بوحجار", "حمام بني صالح", "الزيتونة", "مجاز الرصاف", "واد الزيتون"],
    "37": ["تيندوف", "أم العسل"],
    "38": ["تيسمسيلت", "ثنية الحد", "الأزهارية", "برج بونعامة", "لرجام", "بوقايد", "خميستي", "سيدي عابد", "سيدي سليمان", "بني شعيب", "بني لحسن", "العيون", "عماري", "اليوسفي", "سيدي بوتشنت", "الملعب"],
    "39": ["الوادي", "المغير", "جامعة", "الرباح", "حاسي خليفة", "الدبيلة", "قمار", "الرقيبة", "وادي العلندة", "أميه ونسة", "الطريفاوي", "البياضة", "النخلة", "سيدي عون", "المقرن", "ورماس", "تغزوت", "دوار الماء", "اعوينت", "كويف"],
    "40": ["خنشلة", "ششار", "قايس", "أولاد رشاش", "المحمل", "عين الطويلة", "بابار", "الحامة", "تاوزيانت", "بوحمامة", "الرميلة", "يابوس", "لمصارة", "جلال", "بغاى", "انسيغة", "خيران", "طامزة", "عين جربوع", "شلية", "الولجة"],
    "41": ["سوق أهراس", "سدراتة", "مداوروش", "تاورة", "الحدادة", "المراهنة", "بئر بوحوش", "المشروحة", "أم العظايم", "ويلان", "سيدي فرج", "لحنانشة", "تيفاش", "الزعرورية", "الدريعة", "عين الزانة", "أولاد إدريس", "ترقالت", "وادي الكبريت"],
    "42": ["تيبازة", "شرشال", "القليعة", "بوإسماعيل", "عين تاقورايت", "سيدي غيلاس", "سيدي راشد", "الشعيبة", "الداموس", "حجرة النص", "مناصر", "مسلمون", "أحمر العين", "بورقيقة", "حطاطبة", "سيدي عمر", "الناظور", "بوهارون", "عين بن يان", "قوراية", "أغبال", "مراد"],
    "43": ["ميلة", "شلقوم العيد", "فرجيوة", "تاجنانت", "وادي النجاء", "التلاغمة", "بوحاتم", "القرارم قوقة", "الرواشد", "عين البيضاء أحريش", "ترعي باينان", "سيدي مروان", "تيبرقنت", "أحمد راشدي", "تسالة لمطاعي", "أولاد خلوف", "المشيرة", "العياضي برباس", "عين التين"],
    "44": ["عين الدفلى", "خميس مليانة", "مليانة", "العطاف", "الروينة", "بوراشد", "بومدفع", "جندل", "سيدي لخضر", "جليدة", "العامرة", "عين لشياخ", "المخاطرية", "الحسنية", "عاريب", "بني ونيف", "بير ولد خليفة", "واد الشرفاء", "الحسينية", "زيدين", "بربوش"],
    "45": ["النعامة", "المشرية", "عين الصفراء", "تيوت", "مغرار", "عسلة", "جنين بورزق", "صفيصيفة", "مكمن بن عمار", "القسدير", "البيوض", "عين بن خليل"],
    "46": ["عين تموشنت", "حمام بوحجر", "بني صاف", "المالح", "العامرية", "عين الكيحل", "ولهاصة", "تارقة", "شعبة اللحم", "سيدي بن عدة", "أغلال", "عقب الليل", "تامزورة", "مساعد", "أولاد بوجمعة", "سيدي صافي", "عين الطلبة", "الأمير عبد القادر"],
    "47": ["غرداية", "القرارة", "بريان", "زلفانة", "متليلي", "المنيعة", "ضاية بن ضحوة", "بونورة", "العطف", "حاسي الفحل", "حاسي القارة", "سبسب", "المنصورة"],
    "48": ["غليزان", "وادي ارهيو", "مازونة", "زمورة", "عمي موسى", "جديوية", "يلل", "المطمر", "سيدي خطاب", "سيدي امحمد بن علي", "منداس", "الحمادنة", "القلعة", "بني درقن", "وادي الجمعة", "بلعسل", "سيدي سعادة", "مرجة سيدي عابد", "دار بن عبد الله"],
    "49": ["تيميمون", "أوقروت", "شروين"], // ولاية منتدبة سابقاً، البلديات مكررة من أدرار، but useful to have explicit code
    "50": ["برج باجي مختار", "تيمياوين"],
    "51": ["أولاد جلال", "سيدي خالد", "الدوسن"], // من بسكرة
    "52": ["بني عباس", "كرزاز", "الواتة", "تامنطيت"], // من بشار
    "53": ["عين صالح", "فقارة الزوى", "إينغر"], // من تمنراست
    "54": ["عين قزام", "تين زواتين"], // من تمنراست
    "55": ["تقرت", "تماسين", "المقارين", "الطيبات"], // من ورقلة
    "56": ["جانت", "برج الحواس"], // من إيليزي
    "57": ["المغير", "جامعة", "سطيل"], // من الوادي
    "58": ["المنيعة", "حاسي القارة"] // من غرداية
};

function getBaladiyas(wilayaCode) {
    // Extract code from string "01 - أدرار" -> "01"
    const code = wilayaCode.split(' - ')[0];

    if (locationData[code]) {
        return locationData[code];
    } else {
        return ["بلدية غير متوفرة"];
    }
}
